Autodesk.Revit.DB.NumberingSchemaType.op_Inequality(Autodesk.Revit.DB.NumberingSchemaType,Autodesk.Revit.DB.NumberingSchemaType)
Compares two NumberingSchemaType instances.
first: The first NumberingSchemaType.
second: The second NumberingSchemaType.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.DB.NumberingSchemaType.op_Equality(Autodesk.Revit.DB.NumberingSchemaType,Autodesk.Revit.DB.NumberingSchemaType)
Compares two NumberingSchemaType instances.
first: The first NumberingSchemaType.
second: The second NumberingSchemaType.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.DB.NumberingSchemaType.#ctor(System.Guid)
Creates a new NumberingSchemaType instance.
guid: The identifier for the NumberingSchemaType.

Autodesk.Revit.DB.NumberingSchemaType
A type for identifying a Autodesk.Revit.DB.NumberingSchema of a particular kind.
Remarks:
Each numbering schema is applicable to a certain category of Revit elements. For example, the Rebar
numbering schema (built-in) is used and only applicable to Rebar elements. With that schema present,
all Rebar elements automatically will get their respective numbers and those numbers would not correspond
in any way to numbers of other enumerable elements that belong to different numbering schemas.
There are only built-in schemas available currently.
Since:
2015